In [1]:
#pdという名でpandasを実行
import pandas as pd

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                    columns=['col01','col02','col3'],
                    index=['idx01','idx02','idx03'])
df

       col01  col02  col3
idx01      1      2     3
idx02      4      5     6
idx03      7      8     9

In [3]:
#NumPy 高速にリストを計算する為のライブラリ
import numpy as np

In [4]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                  columns=['col01','col02','col03'],
                  index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [5]:
df.index #index縦行取得方法

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [6]:
df.columns #columns横列取得方法

Index(['col01', 'col02', 'col03'], dtype='object')

In [7]:
# 辞書型
df = pd.DataFrame({'col01':[1,2,3],
                   'col02':[4,5,6],
                   'col03':[7,8,9]})
df #index はindex番号になってしまう

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [8]:
df = pd.DataFrame({'col01':[1,2,3],
                   'col02':[4,5,6],
                   'col03':[7,8,9]})

df.index=['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [9]:
df = pd.DataFrame({'col01':[1,2,3],
                   'col02':[4,5,6],
                   'col03':[7,8,9]}
                 ,index=['idx01','idx02','idx03'])
df # こちらでもOK

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [11]:
df = pd.DataFrame([[1,2,3],
                   [4,5,6],
                   [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
df.columns=['col01','col02','col03']
df.index=['idx01','idx02','idx03']

df # 最後のdfはセルを分けても 1つのセルにまとめて書いても良い

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [15]:
df.columns=['col04','col05','col06']

In [16]:
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [17]:
df = df.rename(columns={'col04':'x'})
df  #renameメソッドで行・列名の一部を変更{'変更前':'変更後'}

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [18]:
df = df.rename(columns={'col05':'y','col06':'z'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [19]:
df = df.rename(index={'idx01':'w'})
df #renameメソッドはindexも変更可

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [20]:
df['x'] #データフレームからSeries(1列)として取得

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [21]:
type(df['x']) #データ型はSeries

pandas.core.series.Series

In [22]:
df[['x']] #　列をデータフレーム形式で取得

       x
w      1
idx02  4
idx03  7

In [23]:
type(df[['x']]) # データ型はDataFrame

pandas.core.frame.DataFrame

In [24]:
df.loc['w'] #loc 行名列名を取得して行を取得

x    1
y    2
z    3
Name: w, dtype: int64

In [25]:
df.loc['w','z'] # 行列名を指定して特定の値を取得

3

In [26]:
df.loc[:,'x'] #x列全取得

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [27]:
df.iloc[:,0]

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [30]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                  columns=['col01','col02','col03'],
                  index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [31]:
df.loc['idx01'] #idx01 行を全て取得

col01    1
col02    2
col03    3
Name: idx01, dtype: int32

In [33]:
df.loc['idx01','col02'] #最初に行 次に列

2

In [35]:
df.loc[:,'col01'] #全部 列取得

idx01    1
idx02    4
idx03    7
Name: col01, dtype: int32

In [36]:
df.iloc[:,0] #iloc 行や列の番号を指定して値を取得する

idx01    1
idx02    4
idx03    7
Name: col01, dtype: int32

In [37]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                  columns=['col01','col02','col03'],
                  index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [38]:
df.loc['idx03','col02']

8

In [39]:
df.loc['idx03','col02']=100
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7    100      9

In [42]:
df.loc[:,'col03']=['Tokyo','Osaka','Hokkaido']
# 一度に値を変更したい場合はリストにする
df #取得時名前を間違えると追加になる

       col01  col02     col03      col3
idx01      1      2     Tokyo     Tokyo
idx02      4      5     Osaka     Osaka
idx03      7    100  Hokkaido  Hokkaido

In [43]:
df.loc[:,'col02':'col03']

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [59]:
df.iloc[:,0:2]

       col01  col02
idx01      1      2
idx02      4      5
idx03      7    100

In [55]:
df.index.get_loc('idx03') # 行番号の取得

2

In [60]:
df.columns.get_loc('col02') # 列番号の取得

1

In [61]:
df.iloc[df.index.get_loc('idx03'), df.columns.get_loc('col02')]=1000
df

       col01  col02     col03      col3
idx01      1      2     Tokyo     Tokyo
idx02      4      5     Osaka     Osaka
idx03      7   1000  Hokkaido  Hokkaido

In [62]:
df.dtypes # それぞれのデータ型が表示される

col01     int32
col02     int32
col03    object
col3     object
dtype: object

In [63]:
df.shape # 行数 列数をまとめて取得

(3, 4)

In [64]:
df

       col01  col02     col03      col3
idx01      1      2     Tokyo     Tokyo
idx02      4      5     Osaka     Osaka
idx03      7   1000  Hokkaido  Hokkaido

In [65]:
df = df.T # 行と列を入れ替える

In [66]:
df

       idx01  idx02     idx03
col01      1      4         7
col02      2      5      1000
col03  Tokyo  Osaka  Hokkaido
col3   Tokyo  Osaka  Hokkaido

## 確認問題

In [67]:
df = pd.DataFrame({'col01':[1,2,3], 'col02':[4,5,6],'col03':[7,8,9]}
                 ,index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [68]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [69]:
df = df.rename(index={'idx03':'idx04'})
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx04      3      6      9

In [74]:
df['col01'] #df.loc[:,'col01']でも取得可

idx01    1
idx02    2
idx04    3
Name: col01, dtype: int64

In [75]:
df.iloc[:,0]

idx01    1
idx02    2
idx04    3
Name: col01, dtype: int64

In [76]:
df.loc[:,'col01':'col02']

       col01  col02
idx01      1      4
idx02      2      5
idx04      3      6

In [77]:
df.dtypes

col01    int64
col02    int64
col03    int64
dtype: object